---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.LightingDevice
source: html/a9c79637-4770-988f-252d-fb42e50689ab.htm
---
# LightingDevice Properties

Retrieves the Connector Manager from this MEPModel.